[{"data":1,"prerenderedAt":94},["ShallowReactive",2],{"data":3,"content-portfolio":77,"content-portfolio/paravyomayoga":93},[4],{"_path":5,"_dir":6,"_draft":7,"_partial":7,"_locale":8,"title":9,"description":10,"images":11,"imageposition":13,"category":14,"tags":15,"body":18,"_type":71,"_id":72,"_source":73,"_file":74,"_stem":75,"_extension":76},"/portfolio/paravyomayoga","portfolio",false,"","Website Yogaterapia","Plataforma digital para promover cursos, gerenciar inscrições e otimizar a administração da escola.",[12],"/images/portfolio/paravyoma.png","top","site",[16,17],"marketing","comunicação",{"type":19,"children":20,"toc":68},"root",[21,28,33,38,43,48,53,58,63],{"type":22,"tag":23,"props":24,"children":25},"element","p",{},[26],{"type":27,"value":10},"text",{"type":22,"tag":23,"props":29,"children":30},{},[31],{"type":27,"value":32},"O objetivo do projeto era criar um site intuitivo e funcional que não apenas apresentasse os serviços do professor, mas também facilitasse a experiência dos alunos e a gestão dos cursos.",{"type":22,"tag":23,"props":34,"children":35},{},[36],{"type":27,"value":37},"Sobre o Projeto\nO site foi concebido para ser uma ferramenta multifuncional, atendendo às necessidades do professor de Yogaterapia de maneira eficaz e integrada. As principais funcionalidades incluem:",{"type":22,"tag":23,"props":39,"children":40},{},[41],{"type":27,"value":42},"Sistema de Controle de Inscrições: Criamos um sistema automatizado de controle de inscrições que permite aos alunos se cadastrarem facilmente nos cursos oferecidos. Esse sistema facilita o gerenciamento de turmas, permitindo ao professor visualizar e administrar as inscrições de forma centralizada e eficiente.",{"type":22,"tag":23,"props":44,"children":45},{},[46],{"type":27,"value":47},"Relatórios Administrativos: Desenvolvemos um módulo de relatórios administrativos que fornece insights detalhados sobre o progresso dos alunos, frequência nas aulas e outras métricas importantes. Esses relatórios ajudam o professor a tomar decisões informadas sobre o gerenciamento de suas aulas e a ajustar seus métodos de ensino conforme necessário.",{"type":22,"tag":23,"props":49,"children":50},{},[51],{"type":27,"value":52},"Design Intuitivo e Responsivo: O site foi projetado com um layout limpo e responsivo, garantindo uma experiência de usuário agradável em dispositivos móveis e desktops. Isso facilita o acesso dos alunos às informações dos cursos, à inscrição e ao acompanhamento do seu progresso.",{"type":22,"tag":23,"props":54,"children":55},{},[56],{"type":27,"value":57},"Tecnologias Utilizadas\nPara construir este site, utilizamos um conjunto de tecnologias modernas que garantem segurança, escalabilidade e fácil manutenção. O frontend foi desenvolvido com HTML5, CSS3 e JavaScript para proporcionar uma experiência de navegação suave e responsiva. Para o backend, implementamos um sistema baseado em PHP e MySQL, garantindo um gerenciamento de dados robusto e eficiente.",{"type":22,"tag":23,"props":59,"children":60},{},[61],{"type":27,"value":62},"Resultados\nDesde o lançamento do novo site, o professor de Yogaterapia relatou uma melhoria significativa na gestão de suas aulas e no processo de inscrição dos alunos. O sistema automatizado de controle de inscrições reduziu o tempo gasto em tarefas administrativas, permitindo que o professor se concentre mais no ensino e na interação com os alunos. Os relatórios administrativos também têm sido um recurso valioso para monitorar o desempenho dos alunos e melhorar continuamente a qualidade do ensino.",{"type":22,"tag":23,"props":64,"children":65},{},[66],{"type":27,"value":67},"Conclusão\nEste projeto é um exemplo de como um site bem projetado pode transformar a administração e a operação de um negócio educacional. Ao combinar design intuitivo com funcionalidades poderosas, conseguimos criar uma plataforma que não só atende às necessidades do cliente, mas também oferece uma experiência aprimorada para os usuários finais.",{"title":8,"searchDepth":69,"depth":69,"links":70},2,[],"markdown","content:portfolio:paravyomayoga.md","content","portfolio/paravyomayoga.md","portfolio/paravyomayoga","md",{"_path":78,"_dir":79},"/portfolio/_dir",{"_path":78,"title":80,"description":8,"images":81,"imageposition":83,"data":84,"body":85},"Portfólio",[82],"/images/products/desenvolvimentoweb_horizontal.webp","hide","10/10/2024",{"type":19,"children":86,"toc":91},[87],{"type":22,"tag":88,"props":89,"children":90},"listcard",{"title":80},[],{"title":8,"searchDepth":69,"depth":69,"links":92},[],{"_path":5,"title":9},1725243709860]